---
kind: type
id: T:Autodesk.Revit.DB.GridSegmentDirection
source: html/d092a487-df66-fa3f-bfef-7d11003ecb8c.htm
---
# Autodesk.Revit.DB.GridSegmentDirection

Specify one of the four adjacent segments to a
GridNode.
See DividedSurface .

## Syntax (C#)
```csharp
public enum GridSegmentDirection
```